---
type: RebarHandleNameData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# RebarHandleNameData

`Autodesk.Revit.DB.Structure.RebarHandleNameData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCustomHandleTag | 2018 | `public int GetCustomHandleTag ()` |
| Method | SetCustomHandleName | 2018 | `public void SetCustomHandleName ( string customHandleName )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |